simulation/medium/airfoil_base/system/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

wallShearStress
{
    type            wallShearStress;
    libs            (fieldFunctionObjects);
    patches         (airfoil);

    executeControl  onEnd;
    writeControl    onEnd;
}


// ************************************************************************* //
